////////////////////////////////////////////////////////////////////////////////
//
// Helper routines that'll be accessible in every meta-directive.
//



/* #meta global CMSIS_SET, CMSIS_WRITE, CMSIS_SPINLOCK, CMSIS_TUPLE, make_named_enums

    from deps.stpy.cmsis_tools import get_cmsis_tools

    cmsis_tools    = get_cmsis_tools(Meta)
    CMSIS_SET      = cmsis_tools.CMSIS_SET
    CMSIS_WRITE    = cmsis_tools.CMSIS_WRITE
    CMSIS_SPINLOCK = cmsis_tools.CMSIS_SPINLOCK
    CMSIS_TUPLE    = cmsis_tools.CMSIS_TUPLE

    def make_named_enums(members_string):

        members = members_string.split()

        enumeration_name = Meta.meta_directive.include_file_path.stem

        Meta.enums(enumeration_name, 'u32', members)

        Meta.lut(f'{enumeration_name}_TABLE', (
            (
                ('char*', 'name', f'"{member}"',),
            )
            for member in members
        ))

*/



////////////////////////////////////////////////////////////////////////////////
//
// Standard headers.
//



#include <string.h>
#include <stdatomic.h>



////////////////////////////////////////////////////////////////////////////////
//
// Some useful macro definitions.
//



#define false                   0
#define true                    1
#define STRINGIFY_(X)           #X
#define STRINGIFY(X)            STRINGIFY_(X)
#define CONCAT_(X, Y)           X##Y
#define CONCAT(X, Y)            CONCAT_(X, Y)
#define IS_POWER_OF_TWO(X)      ((X) > 0 && ((X) & ((X) - 1)) == 0)
#define sizeof(...)             ((signed) sizeof(__VA_ARGS__))
#define countof(...)            (sizeof(__VA_ARGS__) / sizeof((__VA_ARGS__)[0]))
#define bitsof(...)             (sizeof(__VA_ARGS__) * 8)
#define implies(P, Q)           (!(P) || (Q))
#define iff(P, Q)               (!!(P) == !!(Q))
#define useret                  __attribute__((warn_unused_result))
#define mustinline              __attribute__((always_inline)) inline
#define noret                   __attribute__((noreturn))
#define fallthrough             __attribute__((fallthrough))
#define pack_push               _Pragma("pack(push, 1)")
#define pack_pop                _Pragma("pack(pop)")
#define memeq(X, Y)             (static_assert_expr(sizeof(X) == sizeof(Y)), !memcmp(&(X), &(Y), sizeof(Y)))
#define memzero(X)              memset((X), 0, sizeof(*(X)))
#define static_assert_expr(...) ((void) sizeof(struct { static_assert(__VA_ARGS__, #__VA_ARGS__); }))
#define PI                      3.14159265359f
#ifndef offsetof
#define offsetof __builtin_offsetof
#endif



////////////////////////////////////////////////////////////////////////////////
//
// We could just use the definitions from <stdint.h>,
// but they won't necessarily match up well
// with `printf` well at all. For example, we'd like
// for the "%d" specifier to work with `i32`
//



typedef unsigned char      u8;  static_assert(sizeof(u8 ) == 1);
typedef unsigned short     u16; static_assert(sizeof(u16) == 2);
typedef unsigned           u32; static_assert(sizeof(u32) == 4);
typedef unsigned long long u64; static_assert(sizeof(u64) == 8);
typedef signed   char      i8;  static_assert(sizeof(i8 ) == 1);
typedef signed   short     i16; static_assert(sizeof(i16) == 2);
typedef signed             i32; static_assert(sizeof(i32) == 4);
typedef signed   long long i64; static_assert(sizeof(i64) == 8);
typedef unsigned char      b8;  static_assert(sizeof(b8 ) == 1);
typedef unsigned short     b16; static_assert(sizeof(b16) == 2);
typedef unsigned           b32; static_assert(sizeof(b32) == 4);
typedef unsigned long long b64; static_assert(sizeof(b64) == 8);
typedef float              f32; static_assert(sizeof(f32) == 4);
typedef double             f64; static_assert(sizeof(f64) == 8);



#if !COMPILING_ESP32



////////////////////////////////////////////////////////////////////////////////
//
// @/`Error Handling with Bugs and Sorrys`.
//



#define BUG_CODE 0xDEADC0DE // Large arbitrary value that an enum will unlikely overlap with.
#define sorry    sorry_();  // This syntax makes `sorry` pop out more obviously.

#if 1
    #define bug                                                                  \
        do                                                                       \
        {                                                                        \
            sorry            /* Halt the CPU to make debugging issues easier. */ \
            return BUG_CODE; /* Here for type-checking reasons. */               \
        }                                                                        \
        while (false)
#else
    #define bug return BUG_CODE // Bugs are bubbled up and handled by the caller.
#endif

